# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [2]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [3]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [4]:
#  1. Get the total rides for each city type

suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]

In [73]:
total_rides_by_type = pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides_by_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [5]:
#total rides for Suburban
suburban_total_rides = len(suburban_cities_df)
suburban_total_rides

625

In [6]:
#total rides for Rural
rural_total_rides = len(rural_cities_df)
rural_total_rides

125

In [7]:
#total rides for Urban
urban_total_rides = len(urban_cities_df)
urban_total_rides

1625

In [8]:
suburban_cities_df.head(5)

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,2019-01-27 03:08:01,27.79,6653622887913,11,Suburban
1626,East Kentstad,2019-04-07 19:44:19,18.75,6575961095852,20,Suburban
1627,Lake Omar,2019-01-17 21:33:35,21.71,966911700371,22,Suburban
1628,Myersshire,2019-02-27 17:38:39,17.10,5706770909868,19,Suburban
1629,West Hannah,2019-04-19 01:06:59,37.78,2273047151891,12,Suburban

In [64]:
# 2. Get the total drivers for each city type
#urban
total_drivers_by_type = city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [10]:
#suburban
total_suburban_drivers = suburban_cities_df["driver_count"].sum()
total_suburban_drivers

8570

In [11]:
#rural
total_rural_drivers = rural_cities_df["driver_count"].sum()
total_rural_drivers

537

In [12]:
#  3. Get the total amount of fares for each city type

In [66]:
total_fares_by_type= pyber_data_df.groupby(["type"]).sum()["fare"]
total_fares_by_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [13]:
# urban total amount of fares
total_urban_fares = urban_cities_df["fare"].sum()
total_urban_fares

39854.380000000005

In [14]:
#suburban total amount of fares
total_suburban_fares = suburban_cities_df["fare"].sum()
total_suburban_fares

19356.33

In [15]:
#rural total amount of fares
total_rural_fares = rural_cities_df["fare"].sum()
total_rural_fares

4327.929999999999

In [16]:
#  4. Get the average fare per ride for each city type.

In [74]:
avg_fares_per_ride = total_fares_by_type / total_rides_by_type

In [30]:
#urban
urban_avg_fare = urban_cities_df["fare"].mean()
urban_avg_fare

24.52577230769236

In [31]:
#suburban
suburban_avg_fare = suburban_cities_df["fare"].mean()
suburban_avg_fare

30.97012800000002

In [32]:
#rural
rural_avg_fare = rural_cities_df["fare"].mean()
rural_avg_fare

34.623440000000016

In [56]:
# 5. Get the average fare per driver for each city type. 
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [54]:
# urban
urban_total_drivers = urban_cities_df['driver_count'].sum()
urban_total_drivers

59602

In [57]:
urban_driver_avg_fare = pyber_data_df['fare'].sum()/urban_total_drivers
urban_driver_avg_fare

1.06604879030905

In [34]:
#urban
urban_driver_avg_fare = urban_cities_df.groupby(["ride_id"])["fare"].mean()
urban_driver_avg_fare

ride_id
14588103145      38.95
18586563147      26.10
23948941587      18.92
25082058503      33.90
28294640252      17.16
                 ...
9963100218298    28.54
9975084532253    23.35
9979817442901    11.06
9988466063962    31.89
9991537657885    21.46
Name: fare, Length: 1625, dtype: float64

In [35]:
#suburban
surban_driver_avg_fare = suburban_cities_df.groupby(["ride_id"])["fare"].mean()
surban_driver_avg_fare

ride_id
321833677        48.20
1506044208       40.87
16507766547      41.95
30234681362      16.53
38504866921      29.19
                 ...
9839854233835    44.21
9840779665113    40.20
9903881959478    44.71
9913967882910    28.84
9917743781176    39.19
Name: fare, Length: 625, dtype: float64

In [36]:
#rural
urban_driver_avg_fare = urban_cities_df.groupby(["ride_id"])["fare"].mean()
urban_driver_avg_fare

ride_id
14588103145      38.95
18586563147      26.10
23948941587      18.92
25082058503      33.90
28294640252      17.16
                 ...
9963100218298    28.54
9975084532253    23.35
9979817442901    11.06
9988466063962    31.89
9991537657885    21.46
Name: fare, Length: 1625, dtype: float64

In [76]:
#  6. Create a PyBer summary DataFrame.

In [102]:
avg_fares_per_driver = total_fares_by_type / total_drivers_by_type 
avg_fares_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [103]:
avg_fares_per_ride = total_fares_by_type / total_rides_by_type
avg_fares_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [112]:
pyber_ride_summary_df = pd.DataFrame({
        'Total Rides for Each City Type':  total_rides_by_type,
        'Total Drivers for Each City Type': total_drivers_by_type,
        'Total Fares for Each City Type': total_fares_by_type,
        'Average Fare for Each City Type': avg_fares_per_ride,
        'Average Fare for Each Driver per City Type': avg_fares_per_driver
        })

pyber_ride_summary_df

,Total Rides for Each City Type,Total Drivers for Each City Type,Total Fares for Each City Type,Average Fare for Each City Type,Average Fare for Each Driver per City Type
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [78]:
#urban
urban_cities_df.describe()

              fare       ride_id  driver_count
count  1625.000000  1.625000e+03   1625.000000
mean     24.525772  4.873485e+12     36.678154
std      11.738649  2.907440e+12     20.075545
min       4.050000  1.458810e+10      3.000000
25%      14.550000  2.400244e+12     22.000000
50%      24.640000  4.711188e+12     37.000000
75%      34.580000  7.451579e+12     52.000000
max      44.970000  9.991538e+12     73.000000

In [79]:
#suburban
suburban_cities_df.describe()

             fare       ride_id  driver_count
count  625.000000  6.250000e+02    625.000000
mean    30.970128  4.971015e+12     13.712000
std     10.677508  2.912410e+12      8.042372
min     12.050000  3.218337e+08      1.000000
25%     21.970000  2.364253e+12      5.000000
50%     30.750000  5.053221e+12     16.000000
75%     39.830000  7.551674e+12     21.000000
max     49.960000  9.917744e+12     25.000000

In [80]:
#rural
rural_cities_df.describe()

             fare       ride_id  driver_count
count  125.000000  1.250000e+02    125.000000
mean    34.623440  4.647746e+12      4.296000
std     14.558046  2.887834e+12      2.691156
min     10.110000  2.684873e+10      1.000000
25%     19.900000  2.275364e+12      1.000000
50%     37.050000  4.023962e+12      4.000000
75%     47.070000  7.118047e+12      7.000000
max     58.550000  9.990581e+12      9.000000

In [81]:
Total_Rides = pyber_data_df.groupby(["type"]).count()["ride_id"]
Total_Rides.head()

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [82]:
Total_Drivers = pyber_data_df.groupby(["type"]).sum()["driver_count"]
Total_Drivers.head()

type
Rural         537
Suburban     8570
Urban       59602
Name: driver_count, dtype: int64

In [83]:
Total_Fares = pyber_data_df.groupby(["type"]).sum()["fare"]
Total_Fares.head()

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [84]:
Ave_Fare_Per_Ride = Total_Fares/Total_Rides
Ave_Fare_Per_Ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [85]:
Ave_Fare_Per_Driver = Total_Fares/Total_Drivers
Ave_Fare_Per_Driver

type
Rural       8.059460
Suburban    2.258615
Urban       0.668675
dtype: float64

In [86]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

NameError: name 'pyber_summary_df' is not defined

In [46]:
#  7. Cleaning up the DataFrame. Delete the index name
Data.index.name = None

In [47]:

Data = pd.DataFrame({'Total Rides':Total_Rides, 'Total Drivers':'Total_Drivers', 'Total Fares':'Total_Fares', 'Average Fare Per Ride': Ave_Fare_Per_Ride, 'Average Fare Per Driver': average_fare_per_driver})
Data

,Total Rides,Total Drivers,Total Fares,Average Fare Per Ride,Average Fare Per Driver
type,,,,,
Rural,125,Total_Drivers,Total_Fares,34.623440,8.059460
Suburban,625,Total_Drivers,Total_Fares,30.970128,2.258615
Urban,1625,Total_Drivers,Total_Fares,24.525772,0.668675

In [10]:
#  8. Format the columns.

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [12]:
# 9. Using groupby() on the pyber_data_df to create a new DataFrame showing the grup
#  for each date where the indices are the city type and date.

In [60]:
#***************
new_data_frame=pyber_data_df.pivot(index='date', columns='type')
new_data_frame

                     city                                fare                  \
type                Rural     Suburban            Urban Rural Suburban  Urban
date
2019-01-01 00:08:16   NaN          NaN         Liumouth   NaN      NaN  37.91
2019-01-01 00:46:46   NaN  Colemanland              NaN   NaN    47.74    NaN
2019-01-01 02:07:24   NaN    Sotoville              NaN   NaN    24.07    NaN
2019-01-01 03:46:50   NaN          NaN          Royland   NaN      NaN   7.57
2019-01-01 05:23:21   NaN          NaN       West Heidi   NaN      NaN  10.75
...                   ...          ...              ...   ...      ...    ...
2019-05-08 04:20:00   NaN          NaN      Carriemouth   NaN      NaN  21.99
2019-05-08 04:39:49   NaN          NaN     Raymondhaven   NaN      NaN  18.45
2019-05-08 07:29:01   NaN          NaN    North Jasmine   NaN      NaN  18.55
2019-05-08 11:38:35   NaN          NaN  South Karenland   NaN      NaN  19.77
2019-05-08 13:10:18   NaN          NaN    Lake Scottton   NaN      NaN  18.04

                    ride_id                             driver_count           \
type                  Rural      Suburban         Urban        Rural Suburban
date
2019-01-01 00:08:16     NaN           NaN  5.673667e+12          NaN      NaN
2019-01-01 00:46:46     NaN  2.215913e+12           NaN          NaN     23.0
2019-01-01 02:07:24     NaN  7.827432e+12           NaN          NaN     10.0
2019-01-01 03:46:50     NaN           NaN  5.815378e+12          NaN      NaN
2019-01-01 05:23:21     NaN           NaN  6.571513e+12          NaN      NaN
...                     ...           ...           ...          ...      ...
2019-05-08 04:20:00     NaN           NaN  1.179977e+11          NaN      NaN
2019-05-08 04:39:49     NaN           NaN  1.811575e+12          NaN      NaN
2019-05-08 07:29:01     NaN           NaN  5.682021e+12          NaN      NaN
2019-05-08 11:38:35     NaN           NaN  7.837163e+12          NaN      NaN
2019-05-08 13:10:18     NaN           NaN  5.616263e+12          NaN      NaN


type                Urban
date
2019-01-01 00:08:16  69.0
2019-01-01 00:46:46   NaN
2019-01-01 02:07:24   NaN
2019-01-01 03:46:50  64.0
2019-01-01 05:23:21  28.0
...                   ...
2019-05-08 04:20:00  52.0
2019-05-08 04:39:49  11.0
2019-05-08 07:29:01  33.0
2019-05-08 11:38:35   4.0
2019-05-08 13:10:18  58.0

[2375 rows x 12 columns]

In [48]:
#new_dataframe = pyber_data_df.groupby(["type"]).sum()["fare"]
#new_dataframe

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [13]:

# 10. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [83]:
###check why two index
new_data_frame =pyber_data_df.reset_index()
new_data_frame

,index,city,date,fare,ride_id,driver_count,type
0,0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...,...
2370,2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [14]:
#ok 
11. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [64]:
pyber_data_df.pivot(index='date', columns='type', values='fare')

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-05-08 04:20:00    NaN       NaN  21.99
2019-05-08 04:39:49    NaN       NaN  18.45
2019-05-08 07:29:01    NaN       NaN  18.55
2019-05-08 11:38:35    NaN       NaN  19.77
2019-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 3 columns]

In [ ]:
# 12. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2018-01-01':'2018-04-29'.

In [79]:
pyber_data_df.loc('date'=='2018-01-01':'2018-04-29', columns='type', values='fare')

SyntaxError: invalid syntax (<ipython-input-79-2bd9cbc42dda>, line 1)

In [80]:
### datetime  not set
# 13. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
pyber_data_df.pivot(index='date', columns='type', values='fare')

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-05-08 04:20:00    NaN       NaN  21.99
2019-05-08 04:39:49    NaN       NaN  18.45
2019-05-08 07:29:01    NaN       NaN  18.55
2019-05-08 11:38:35    NaN       NaN  19.77
2019-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 3 columns]

In [17]:
# 14. Check that the datatype for the index is datetime using df.info()

In [84]:
#######??
pyber_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2375 entries, 0 to 2374
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city          2375 non-null   object
 1   date          2375 non-null   object
 2   fare          2375 non-null   float64
 3   ride_id       2375 non-null   int64
 4   driver_count  2375 non-null   int64
 5   type          2375 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 209.9+ KB

In [85]:
new_data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2375 entries, 0 to 2374
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         2375 non-null   int64
 1   city          2375 non-null   object
 2   date          2375 non-null   object
 3   fare          2375 non-null   float64
 4   ride_id       2375 non-null   int64
 5   driver_count  2375 non-null   int64
 6   type          2375 non-null   object
dtypes: float64(1), int64(3), object(3)
memory usage: 130.0+ KB

In [18]:
# 15. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
pyber_data_df.pivot(index='date', columns='type', values='fare')

In [19]:
# 16. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')